blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Ragvir Hothi"], ["body", "Midterm 04-18-2024"], ["created_at", "2024-04-18 21:10:59.403810"], ["updated_at", "2024-04-18 21:10:59.403810"], ["status", "public"]]